ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_usbfs_dev_drv_io_dma.c
            /* Descriptors configurations */
            const cy_stc_dma_descriptor_config_t DmaDescr1DCfg = DMA_DESCR_1D_CFG;
            const cy_stc_dma_descriptor_config_t DmaDescr2DCfg = DMA_DESCR_2D_CFG;

            /* Store DMA configuration required for operation */
            endpointData->base   = config->dmaConfig[endpoint]->base;
            endpointData->chNum  = config->dmaConfig[endpoint]->chNum;
            endpointData->descr0 = config->dmaConfig[endpoint]->descr0;
            endpointData->descr1 = config->dmaConfig[endpoint]->descr1;
            endpointData->outTrigMux = config->dmaConfig[endpoint]->outTrigMux;
            endpointData->copyData   = NULL;

            if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA == context->mode)
            {
                if (NULL != endpointData->descr0)
                {
                    /* Initialize DMA descriptor 0 for 1D operation. 
                    * Discard return because descriptor configuration (defined in driver) is valid.
                    */
                    (void) Cy_DMA_Descriptor_Init(endpointData->descr0, &DmaDescr1DCfg);

                    locStatus = CY_USBFS_DEV_DRV_SUCCESS;
                }
            }
            else
            {
                if ((NULL != endpointData->descr0) && (NULL != endpointData->descr1))
                {
                    /* Initialize DMA descriptor 0 for 2D operation. 
                    * Discard return because descriptor configuration (defined in driver) is valid.
                    */
                    (void) Cy_DMA_Descriptor_Init(endpointData->descr0, &DmaDescr2DCfg);
                    

                    /* Initialize DMA descriptor 0 for 1D operation. 
                    * Discard return because descriptor configuration (defined in driver) is valid.
                    */
                    (void)Cy_DMA_Descriptor_Init(endpointData->descr1, &DmaDescr1DCfg);

                    locStatus = CY_USBFS_DEV_DRV_SUCCESS;
                }
            }

            /* Set DMA channel configuration */
            chConfig.enable      = false;
            chConfig.bufferable  = false;
            chConfig.descriptor  = config->dmaConfig[endpoint]->descr0;
            chConfig.preemptable = config->dmaConfig[endpoint]->preemptable;
            chConfig.priority    = config->dmaConfig[endpoint]->priority;

            /* Initialize DMA channel */
            if ((CY_DMA_SUCCESS != Cy_DMA_Channel_Init(endpointData->base, endpointData->chNum, &chConfig)) ||
                (CY_USBFS_DEV_DRV_SUCCESS != locStatus))
            {
                break;
            }

            /* Enable DMA block */
            Cy_DMA_Enable(endpointData->base);
        }
        else
        {
            endpointData->chNum = DMA_INVALID_CHANNEL;
        }

        /* Configuration complete successfully */
        retStatus = CY_USBFS_DEV_DRV_SUCCESS;
    }

    /* Disable all DMAs if any configuration failed */
    if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
    {
        DmaDisable(context);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: DmaDisable
****************************************************************************//**
*
* Disables all DMA channels used by the USBFS Device. 
* The channel state is not verified before being disabled.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
*******************************************************************************/
void DmaDisable(cy_stc_usbfs_dev_drv_context_t *context)
{
    uint32_t endpoint;

    /* Disable DMA channels for data endpoints */
    for (endpoint = 0UL; endpoint < CY_USBFS_DEV_DRV_NUM_EPS_MAX; ++endpoint)
    {
        /* Get pointer to endpoint data */
        cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];

        if (endpointData->chNum != DMA_INVALID_CHANNEL)
        {
            Cy_DMA_Channel_Disable(endpointData->base, endpointData->chNum);
        }
    }
}


/*******************************************************************************
* Function Name: DmaEndpointInit1D
****************************************************************************//**
*
* Configures DMA 1D descriptor used in DMA modes.
*
* \param descr
* The pointer to the DMA descriptor.
*
* \param dataSize
* The DMA transfer data size \ref cy_en_dma_data_size_t.
*
* \param dataReg
* The pointer to the data endpoint data register.
*
*******************************************************************************/
static void DmaEndpointInit1D(cy_stc_dma_descriptor_t *descr, bool inDirection, 
                              cy_en_dma_data_size_t dataSize, volatile uint32_t const *dataReg)
{
    Cy_DMA_Descriptor_SetDataSize(descr, dataSize);

    if (inDirection)
    {
        Cy_DMA_Descriptor_SetSrcTransferSize(descr, CY_DMA_TRANSFER_SIZE_DATA);
        Cy_DMA_Descriptor_SetDstTransferSize(descr, CY_DMA_TRANSFER_SIZE_WORD);

        Cy_DMA_Descriptor_SetXloopSrcIncrement(descr, DMA_XLOOP_INCREMENT);
        Cy_DMA_Descriptor_SetXloopDstIncrement(descr, DMA_NO_INCREMENT);

        Cy_DMA_Descriptor_SetDstAddress(descr, (void const *) dataReg);
    }
    else
    {
        Cy_DMA_Descriptor_SetSrcTransferSize(descr, CY_DMA_TRANSFER_SIZE_WORD);
        Cy_DMA_Descriptor_SetDstTransferSize(descr, CY_DMA_TRANSFER_SIZE_DATA);

        Cy_DMA_Descriptor_SetXloopSrcIncrement(descr, DMA_NO_INCREMENT);
        Cy_DMA_Descriptor_SetXloopDstIncrement(descr, DMA_XLOOP_INCREMENT);

        Cy_DMA_Descriptor_SetSrcAddress(descr, (void const *) dataReg);
    }

    /* Link descriptor to itself */
    Cy_DMA_Descriptor_SetNextDescriptor(descr, descr);    
}


/*******************************************************************************
* Function Name: DmaEndpointInit2D
****************************************************************************//**
*
* Configures DMA 2D descriptor used in the DMA Automatic mode.
*
* \param descr
* The pointer to the DMA descriptor.
*
* \param inDirection
* Endpoint direction associated with DMA descriptor.
*
* \param numElements
* Number of elements to transfer.
*
*******************************************************************************/
static void DmaEndpointInit2D(cy_stc_dma_descriptor_t *descr, bool inDirection, 
                              int32_t numElements)
{
    /* Descriptor 0 (2D): it transfers number of data elements (X loop count) 
    * and increments source/destination (depends on direction) by this amount 
    * (Y loop increment).
    */
    Cy_DMA_Descriptor_SetXloopDataCount(descr, (uint32_t) numElements);

    if (inDirection)
    {
        Cy_DMA_Descriptor_SetYloopSrcIncrement(descr, numElements);
        Cy_DMA_Descriptor_SetYloopDstIncrement(descr, DMA_NO_INCREMENT);
    }
    else
    {
        Cy_DMA_Descriptor_SetYloopSrcIncrement(descr, DMA_NO_INCREMENT);
        Cy_DMA_Descriptor_SetYloopDstIncrement(descr, numElements);
    }
}


