ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_usbfs_dev_drv_io_dma.c
/*******************************************************************************
* Function Name: DmaEndpointSetLength
****************************************************************************//**
*
* Completes DMA initialization for the OUT data endpoint.
* Applicable only when mode is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*
* \param endpoint
* The pointer to the structure that stores endpoint information.
*
*******************************************************************************/
static void DmaEndpointSetLength(bool inDirection, uint32_t size, 
                                 cy_stc_usbfs_dev_drv_endpoint_data_t *endpoint)
{
    uint8_t *buf = endpoint->buffer;
    
    /*
    * Descriptor 0: get number of Y loops. It transfers data in multiples of 32 bytes.
    * Descriptor 1: get number of X loops. It transfers data what was left 1-31 bytes.
    */
    uint32_t numYloops = size / (uint32_t) DMA_YLOOP_INCREMENT;
    uint32_t numXloops = size % (uint32_t) DMA_YLOOP_INCREMENT;

    /* Configure */
    if (inDirection)
    {
        endpoint->startBuf = (uint16_t) size;  /* Store DMA transfer size */
        Cy_DMA_Descriptor_SetSrcAddress(endpoint->descr0, buf);
        Cy_DMA_Descriptor_SetSrcAddress(endpoint->descr1, &buf[size - numXloops]);
    }
    else
    {
        endpoint->startBuf = (numYloops > 0U) ? 1U : 0U; /* Store 1st DMA descriptor to execute */
        Cy_DMA_Descriptor_SetDstAddress(endpoint->descr0, buf);
        Cy_DMA_Descriptor_SetDstAddress(endpoint->descr1, &buf[size - numXloops]);
    }

    /* Configure loop length */
    if (numYloops > 0UL)
    {
        Cy_DMA_Descriptor_SetYloopDataCount(endpoint->descr0, numYloops);
    }

    if (numXloops > 0UL)
    {        
        Cy_DMA_Descriptor_SetXloopDataCount(endpoint->descr1, numXloops);
    }

    /* Chain descriptors to operate */
    if (numYloops == 0UL)
    {
        /* (Size < 32): only Descriptor 1 transfers data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr1, endpoint->descr1);
    }
    else if (numXloops == 0UL)
    {
        /* Size multiple of 32: only Descriptor 0 transfers data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr0, endpoint->descr0);
    }
    else
    {
        /* (Size > 32): both Descriptor 0 and 1 transfer data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr0, endpoint->descr1);
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr1, endpoint->descr0);
    }
    
    /* Keep channel enabled after execution of Descriptor 0 to execute Descriptor 1 */
    Cy_DMA_Descriptor_SetChannelState(endpoint->descr0,
                                        ((numYloops > 0UL) && (numXloops > 0UL)) ?
                                            CY_DMA_CHANNEL_ENABLED : CY_DMA_CHANNEL_DISABLED);
    
    /* Start execution from Descriptor 0 (length >= 32) or Descriptor 1 (length < 32) */
    Cy_DMA_Channel_SetDescriptor(endpoint->base, endpoint->chNum,
                                    ((numYloops > 0UL) ? endpoint->descr0 : endpoint->descr1));
    
    /* Configuration complete: enable channel */
    Cy_DMA_Channel_Enable(endpoint->base, endpoint->chNum);
}

      
/*******************************************************************************
* Function Name: DmaOutEndpointRestore
****************************************************************************//**
*   
* Restores the DMA channel after transfer is completed for the the OUT data endpoint.
* Applicable only when mode is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*
* \param endpoint
* The pointer to the structure that stores endpoint information.
*
*******************************************************************************/
void DmaOutEndpointRestore(cy_stc_usbfs_dev_drv_endpoint_data_t *endpoint)
{
    /* Number of clocks for DMA completion pulse */
    const uint32_t CY_USBFS_DEV_DRV_TRIG_CYCLES = 2UL;

    /* Define which descriptor is 1st in the chain */
    bool setDescr0 = (0U != endpoint->startBuf);

    /* Channel disable aborts on-going transfer */
    Cy_DMA_Channel_Disable(endpoint->base, endpoint->chNum);

    /* Send pulse to UBSFS IP to indicate end of DMA transfer */
    (void) Cy_TrigMux_SwTrigger(endpoint->outTrigMux, CY_USBFS_DEV_DRV_TRIG_CYCLES);

    /* Set 1st DMA descriptor for the following transfer */
    Cy_DMA_Channel_SetDescriptor(endpoint->base, endpoint->chNum,
                                                (setDescr0 ? endpoint->descr0 : endpoint->descr1));

    Cy_DMA_Channel_Enable(endpoint->base, endpoint->chNum);
}


/*******************************************************************************
* Function Name: DmaEndpointInit
****************************************************************************//**
*
* Initializes DMA descriptor for a certain data endpoint.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpointAddr
* The data endpoint address (7 bit - direction, 3-0 bits - endpoint number).
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t DmaEndpointInit(USBFS_Type *base, 
                                             cy_en_usbfs_dev_drv_ep_management_mode_t mode, 
                                             bool useReg16, 
                                             cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData)
{
    cy_en_dma_data_size_t regSize;
    int32_t numElements;
    uint32_t volatile *dataReg;

    /* Get direction and endpoint number */
    bool inDirection  = IS_EP_DIR_IN(endpointData->address);
    uint32_t endpoint = EPADDR2PHY(endpointData->address);

    if (DMA_INVALID_CHANNEL == endpointData->chNum)
    {
        return CY_USBFS_DEV_DRV_DMA_CFG_FAILED;
    }

