ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_usbfs_dev_drv_io_dma.c
    /* Set configuration variables depending on access type */
    if (useReg16)
    {
        dataReg     = Cy_USBFS_Dev_Drv_GetDataReg16Addr(base, endpoint);
        regSize     = CY_DMA_HALFWORD;
        numElements = (DMA_YLOOP_INCREMENT / 2);
    }
    else
    {
        dataReg     = Cy_USBFS_Dev_Drv_GetDataRegAddr(base, endpoint);
        regSize     = CY_DMA_BYTE;
        numElements = DMA_YLOOP_INCREMENT;
    }

    /* Disable channel before configuration */
    Cy_DMA_Channel_Disable(endpointData->base, endpointData->chNum);

    /* Configure Descriptor 0 for 1D operation */
    DmaEndpointInit1D(endpointData->descr0, inDirection, regSize, dataReg);

    if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO == mode)
    {
        /* Configure Descriptor 0 for 2D operation */
        DmaEndpointInit2D(endpointData->descr0, inDirection, numElements);

        /* Configure Descriptor 1 for 1D operation */
        DmaEndpointInit1D(endpointData->descr1, inDirection, regSize, dataReg);

        /* Configure descriptors to access buffer */
        DmaEndpointSetLength(inDirection, (uint32_t) endpointData->bufferSize, endpointData);
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: DynamicEndpointReConfiguration
****************************************************************************//**
*
* Changes endpoint direction (IN -> OUT or OUT -> IN).
* This function is also used to flush IN or OUT endpoint buffer.
* Applicable only when mode is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*
* \param base
* The pointer to the USBFS instance.
*
* \param inDirection
* True - endpoint direction is IN; False - endpoint direction is OUT.
*
* \param endpoint
* The data endpoint number.
* 
* \return 
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t DynamicEndpointReConfiguration(USBFS_Type *base,
                                                            bool        inDirection,
                                                            uint32_t    endpoint)
{
    cy_en_usbfs_dev_drv_status_t retStatus = CY_USBFS_DEV_DRV_EP_DYN_RECONFIG_TIMEOUT;

    uint32_t timeout = DYN_RECONFIG_TIMEOUT;

    /* Only enabled endpoint can be re-configured */
    if (0U == (USBFS_DEV_EP_ACTIVE(base) & EP2MASK(endpont)))
    {
        return CY_USBFS_DEV_DRV_BUF_ALLOC_FAILED;
    }

    /* Request reconfiguration for endpoint */
    USBFS_DEV_DYN_RECONFIG(base) = (USBFS_USBDEV_DYN_RECONFIG_EN_Msk |
                                    _VAL2FLD(USBFS_USBDEV_DYN_RECONFIG_EPNO, endpoint));

    /* Cypress ID#295549: execute dummy read */
    (void) USBFS_DEV_DYN_RECONFIG(base);

    /* Wait for dynamic re-configuration completion */
    while ((0U == (USBFS_DEV_DYN_RECONFIG(base) & USBFS_USBDEV_DYN_RECONFIG_RDY_STS_Msk)) &&
           (timeout > 0U))
    {
        Cy_SysLib_DelayUs(DYN_RECONFIG_ONE_TICK);
        --timeout;
    }

    /* Verify operation result */
    if (timeout > 0U)
    {
        Cy_USBFS_Dev_Drv_SetEpType(base, inDirection, endpoint);
        retStatus = CY_USBFS_DEV_DRV_SUCCESS;
    }

    /* Complete endpoint reconfiguration: clear request */
    USBFS_DEV_DYN_RECONFIG(base) &= ~USBFS_USBDEV_DYN_RECONFIG_EN_Msk;
    (void) USBFS_DEV_DYN_RECONFIG(base);

    /* Clear register for next re-configuration */
    USBFS_DEV_DYN_RECONFIG(base) = 0U;
    
    return retStatus;
}


/*******************************************************************************
* Function Name: AddEndpointRamBuffer
****************************************************************************//**
*
* Implements \ref Cy_USBFS_Dev_Drv_AddEndpoint for 
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO mode.
*
* \param base
* The pointer to the USBFS instance.
*
* \param config
* The pointer to data endpoint configuration \ref cy_stc_usb_dev_ep_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t AddEndpointRamBuffer(USBFS_Type *base,
                                                  cy_stc_usb_dev_ep_config_t const *config,
                                                  cy_stc_usbfs_dev_drv_context_t   *context)
{
    cy_en_usbfs_dev_drv_status_t retStatus = CY_USBFS_DEV_DRV_BAD_PARAM;

    uint32_t endpoint = EPADDR2PHY(config->endpointAddr);

    /* Get pointer to endpoint data */
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];

    /* Get buffer for endpoint using buffer allocated by the user */
    if (config->allocBuffer)
    {
        uint32_t startBufIdx;

        /* Configure active endpoint */
        context->activeEpMask    |= (uint8_t) EP2MASK(endpont);
        USBFS_DEV_EP_ACTIVE(base) = context->activeEpMask;
        
        /* Allocate buffer for endpoint */
        retStatus = GetEndpointBuffer((uint32_t) config->bufferSize, &startBufIdx, context);
        if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
        {
            return retStatus;
        }

        /* Store pointer to buffer for this endpoint */
        endpointData->buffer = &context->epSharedBuf[startBufIdx];
    }

    /* Enable endpoint for operation */
    if (config->enableEndpoint)
    {
        bool inDirection = IS_EP_DIR_IN(config->endpointAddr);
        
        /* Clear variables related to endpoint */
        endpointData->state   = CY_USB_DEV_EP_IDLE;
        endpointData->address = config->endpointAddr;
        endpointData->toggle  = 0U;
        endpointData->bufferSize = config->maxPacketSize;
        endpointData->sieMode    = GetEndpointActiveMode(inDirection, config->attributes);
        endpointData->isPending  = false;

        /* Set arbiter configuration (clears DMA requests) */
        Cy_USBFS_Dev_Drv_SetArbEpConfig(base, endpoint, (USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Msk |
                                                         USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Msk));

        /* Performs dynamic reconfiguration to make sure that the DMA has completed the data transfer. 
        * Also it flushes endpoint pre-fetch buffer (useful for IN endpoints).
        */
        retStatus = DynamicEndpointReConfiguration(base, inDirection, endpoint);
        if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
        {
            return retStatus;
        }
    
        /* Configure DMA for endpoint */
        retStatus = DmaEndpointInit(base, context->mode, context->useReg16, endpointData);
        if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
        {
            return retStatus;
        }
        
