ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_usbfs_dev_drv_io_dma.c
    /* Clears the abort mask for the endpoint (there is no transfer during abort) */
    context->epAbortMask &= (uint8_t) ~EP2MASK(endpoint);

    /* Endpoint pending: Waits for the host read data after exiting this function */
    endpointData->state = CY_USB_DEV_EP_PENDING;
    
    /* Set count and data toggle */
    Cy_USBFS_Dev_Drv_SetSieEpCount(base, endpoint, size, (uint32_t) endpointData->toggle);

    if (0U == size)
    {
        /* Arm endpoint: Host is allowed to read data */
        Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, (uint32_t) endpointData->sieMode);
    }
    else
    {
        /* Copy data from user buffer to internal endpoint buffer */
        if (NULL != endpointData->copyData)
        {
            endpointData->copyData(endpointData->buffer, buffer, size);
        }
        else
        {
            (void) memcpy(endpointData->buffer, buffer, size);
        }

        /* Configure transfer length */
        if (size != endpointData->startBuf)
        {
            /* Update transfer length, endpoint startBuf and enables DMA */
            DmaEndpointSetLength(true, size, &context->epPool[endpoint]);
        }
        else
        {
            /* Reset DMA channel indexes, they keep value after Resume or Abort */
            Cy_DMA_Channel_SetDescriptor(endpointData->base, endpointData->chNum, 
                                            (endpointData->startBuf >= (uint32_t) DMA_YLOOP_INCREMENT) ? 
                                                endpointData->descr0 : endpointData->descr1);

            /* Enable channel: configuration complete */
            Cy_DMA_Channel_Enable(endpointData->base, endpointData->chNum);
        }

        /* Generate DMA request to pre-load data into endpoint buffer */
        Cy_USBFS_Dev_Drv_SetArbCfgEpInReady(base, endpoint);

        /* IN endpoint will be armed in the Arbiter interrupt (source: IN_BUF_FULL)
        * after DMA pre-load data buffer.
        */
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: ReadOutEndpointDmaAuto
****************************************************************************//**
*
* Implements \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint for 
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO mode.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param buffer
* Pointer to buffer that stores data that was read.
*
* \param size
* The number of bytes to read from the endpoint.
* This value must be less than or equal to the endpoint maximum packet size.
*
* \param actSize
* The number of bytes which were actually read.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device 
* operation for internal configuration and data retention. The user must not 
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t ReadOutEndpointDmaAuto(USBFS_Type *base,
                                                    uint32_t   endpoint,
                                                    uint8_t    *buffer,
                                                    uint32_t   size,
                                                    uint32_t   *actSize,
                                                    cy_stc_usbfs_dev_drv_context_t *context)
{
    /* Get pointer to endpoint data */
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];
    
    /* Get number of received bytes */
    uint32_t numToCopy = Cy_USBFS_Dev_Drv_GetSieEpCount(base, endpoint);
    
    /* Initialize actual number of copied bytes */
    *actSize = 0U;
    
    /* Endpoint received more bytes than provided buffer */
    if (numToCopy > size)
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    /* Nothing to copy (zero length packet) return success */
    if (0U == numToCopy)
    {
        return CY_USBFS_DEV_DRV_SUCCESS;
    }

    /* Copy data from user buffer to internal endpoint buffer */
    if (NULL != endpointData->copyData)
    {
        (void) endpointData->copyData(buffer, endpointData->buffer, numToCopy);
    }
    else
    {
        (void) memcpy(buffer, endpointData->buffer, numToCopy);
    }
    
    /* Update number of copied bytes */
    *actSize = numToCopy;    
    
    return CY_USBFS_DEV_DRV_SUCCESS;
}


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXUSBFS */


/* [] END OF FILE */
